app/controllers/good_to_knows_controller.rb

  def index
    # @good_to_knows = GoodToKnow.all
    @good_to_knows = GoodToKnow.paginate(:page => params[:page], :per_page => 4)
---
SELECT "good_to_knows".* FROM "good_to_knows"

  def show
    @good_to_knows = GoodToKnow.all
    @good_to_know = GoodToKnow.find(params[:id])
---
SELECT  "good_to_knows".* FROM "good_to_knows" WHERE "good_to_knows"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @good_to_know = GoodToKnow.new(good_to_know_params)

    respond_to do |format|
      if @good_to_know.save
---
INSERT INTO "good_to_knows" ("title", "content", "tags", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Useful Terminal Commands"], ["content", "- "], ["tags", ""], ["created_at", "2016-01-19 08:51:09.696536"], ["updated_at", "2016-01-19 08:51:09.696536"]]

  def update
    respond_to do |format|
      if @good_to_know.update(good_to_know_params)
---
UPDATE "good_to_knows" SET "title" = ?, "content" = ?, "tags" = ?, "updated_at" = ? WHERE "good_to_knows"."id" = ?  [["title", "How to Remove a Folder in a terminal"], ["content", "command: rm -rf folder_name"], ["tags", "terminal, commands, linux"], ["updated_at", "2016-01-19 08:54:06.909925"], ["id", 1]]

  def destroy
    @good_to_know.destroy
---
DELETE FROM "good_to_knows" WHERE "good_to_knows"."id" = ?  [["id", 2]]

    def set_good_to_know
      @good_to_know = GoodToKnow.find(params[:id])
---
SELECT  "good_to_knows".* FROM "good_to_knows" WHERE "good_to_knows"."id" = ? LIMIT 1  [["id", 2]]